app/views/books/show.html.erb

<ul class="list-inline">
<% @book.taggings.each do |tagging| %>
---
SELECT "taggings".* FROM "taggings" WHERE "taggings"."book_id" = ?  [["book_id", 1]]