app/controllers/taggings_controller.rb

SELECT  "taggings".* FROM "taggings" WHERE "taggings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_tagging
      @tagging = Tagging.find(params[:id])