app/controllers/users_controller.rb

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "encrypted_password" = ?, "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["encrypted_password", "$2a$11$xym1Z072N.MoW1DB20dnWegPA3yop6B/Gp7UfTOJLGUa7kjyVDj0m"], ["role", "admin"], ["updated_at", 2017-01-23 01:52:22 UTC], ["id", 1]]