app/views/taggings/_form.html.erb

    <label for="tagging_tag_id">タグ</label>
    <%= f.collection_select :tag_id, tagging, Tag.all.map{|t| [t.name, t.id]}, class: "form-control" %>
---
SELECT "tags".* FROM "tags"